cask_args appdir: "/Applications"

brew "coreutils"
brew "curl"
brew "git"
brew "git-lfs"
brew "go"
brew "gum"
brew "helm"
brew "htop"
brew "jq"
brew "k9s"
brew "krew"
brew "kubectl"
brew "neovim"
brew "p7zip"
brew "pipx"
brew "python"
brew "watch"
brew "zsh"
brew "zsh-completions"

cask "1password"
cask "1password-cli"
cask "brave-browser"
cask "iterm2"
cask "spotify"
cask "visual-studio-code"

vscode "enkia.tokyo-night"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.LiveServer"
vscode "streetsidesoftware.code-spell-checker"
vscode "yzhang.markdown-all-in-one"

# Load host-specific Brewfile
host_brewfile = "#{Socket.gethostname[/^[^.]+/]}.Brewfile"
instance_eval(File.read(host_brewfile)) if File.exist?(host_brewfile)
