cask_args appdir: "/Applications"

tap "homebrew/cask-versions"
tap "cloudflare/cloudflare"

brew "ansible"
brew "awscli"
brew "cloudflared"
brew "coreutils"
brew "curl"
brew "gh"
brew "git-lfs"
brew "go"
brew "gum"
brew "helm"
brew "htop"
brew "jq"
brew "k9s"
brew "mas"
brew "neovim"
brew "p7zip"
brew "python"
brew "rclone"
brew "restic"
brew "watch"
brew "zsh"
brew "zsh-completions"

cask "1password"
cask "arc"
cask "discord"
cask "docker"
cask "firefox"
cask "iterm2"
cask "session-manager-plugin"
cask "spotify"
cask "ticktick"
cask "tunnelblick"
cask "visual-studio-code"
cask "vlc"

mas "Microsoft Remote Desktop", id: 1295203466
