cask_args appdir: "/Applications"

tap "homebrew/cask-versions"
tap "cloudflare/cloudflare"

brew "ansible"
brew "awscli"
brew "cloudflared"
brew "coreutils"
brew "curl"
brew "gh"
brew "git-lfs"
brew "go"
brew "gum"
brew "helm"
brew "htop"
brew "jq"
brew "k9s"
brew "mas"
brew "neovim"
brew "packer"
brew "python"
brew "restic"
brew "tfenv"
brew "tflint"
brew "tfsec"
brew "terraform-docs"
brew "zsh"
brew "zsh-completions"

cask "1password"
cask "discord"
cask "docker"
cask "firefox"
cask "gimp"
cask "google-chrome-dev"
cask "iterm2"
cask "spotify"
cask "thunderbird"
cask "tunnelblick"
cask "visual-studio-code"
cask "vlc"

mas "Amphetamine", id: 937984704
mas "Microsoft Remote Desktop", id: 1295203466
mas "Slack", id: 803453959
