arcticicestudio.nord-visual-studio-code
eamodio.gitlens
enkia.tokyo-night
golang.go
hashicorp.terraform
mattyjones.vscode-tickscript
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-containers
ms-vscode.cpptools
ms-vsliveshare.vsliveshare
redhat.vscode-yaml
ritwickdey.LiveServer
samuelcolvin.jinjahtml
yzhang.markdown-all-in-one
