13xforever.language-x86-64-assembly
arcticicestudio.nord-visual-studio-code
eamodio.gitlens
enkia.tokyo-night
GitHub.copilot
GitHub.copilot-chat
golang.go
hashicorp.terraform
ms-python.python
ms-python.vscode-pylance
ms-vscode.cpptools
ms-vsliveshare.vsliveshare
qwtel.sqlite-viewer
redhat.vscode-yaml
ritwickdey.LiveServer
samuelcolvin.jinjahtml
yzhang.markdown-all-in-one
